//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
//**********************************************************************
//
// $Header: $
//
// $Revision: $
//
// $Date: $
//
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//
//**********************************************************************

//<AMI_FHDR_START>
//----------------------------------------------------------------------------
//
// Name:            TbtSetup.uni
//
// Description:     String for TBT Setup.
//
//----------------------------------------------------------------------------
//<AMI_FHDR_END>

//**********************************************************************
//**********************************************************************
/=#

#include "VFR.uni"

#string STR_TBT_FORM                             #language eng "Intel(R) Thunderbolt"
#string STR_TBT_FORM_HELP                        #language eng "Intel(R) Thunderbolt."

#string STR_TBT_SUBTITLE                         #language eng "Intel(R) Thunderbolt Configuration"

#string STR_TBT_SPEC_VERSION_NAME                #language eng "Thunderbolt Specification Version"
#string STR_TBT_SPEC_VERSION_HELP                #language eng "Thunderbolt Specification Version"
#string STR_TBT_SPEC_VERSION_VALUE               #language eng "N/A"

#string STR_TBT_RC_VERSION_NAME                  #language eng "Intel Sample Code Version"
#string STR_TBT_RC_VERSION_HELP                  #language eng "Intel Sample Code Version"
#string STR_TBT_RC_VERSION_VALUE                 #language eng "N/A"

#string STR_TBT_HOST_NAME                        #language eng "Thunderbolt Host Chip"
#string STR_TBT_HOST_HELP                        #language eng "Thunderbolt Host Chip"
#string STR_TBT_HOST_VALUE                       #language eng "N/A"

//---------------------------------------------------------------------------
// FFS Configuration
//---------------------------------------------------------------------------
#string STR_ENABLED                             #language eng "Enabled"
#string STR_DISABLED                            #language eng "Disabled"

#string STR_TBT_ENABLE_PROMPT                   #language eng "Intel Thunderbolt Technology"
#string STR_TBT_ENABLE_HELP                     #language eng "Enable or Disable Intel(R) Thunderbolt Function."

#string STR_TBT_DEVICE_WAKE_UP_SUPPORT_PROMPT   #language eng "Wake From Thunderbolt Devices"
#string STR_TBT_DEVICE_WAKE_UP_SUPPORT_HELP     #language eng "Enable or disable system wake from Thenderbolt devices."

#string STR_TBT_AIC_SUPPORT_PROMPT              #language eng "AIC Support"
#string STR_TBT_AIC_SUPPORT_HELP                #language eng "Apply Go2Sx command before going to sleep"

#string STR_TBT_HOST_LOCATION_PROMPT            #language eng "AIC Location"
#string STR_TBT_HOST_LOCATION_HELP              #language eng "Thunderbolt AIC Location"
#string STR_TBT_HOST_LOCATION_000               #language eng "SB PCIE D28F0"
#string STR_TBT_HOST_LOCATION_001               #language eng "SB PCIE D28F1"
#string STR_TBT_HOST_LOCATION_002               #language eng "SB PCIE D28F2"
#string STR_TBT_HOST_LOCATION_003               #language eng "SB PCIE D28F3"
#string STR_TBT_HOST_LOCATION_004               #language eng "SB PCIE D28F4"
#string STR_TBT_HOST_LOCATION_005               #language eng "SB PCIE D28F5"
#string STR_TBT_HOST_LOCATION_006               #language eng "SB PCIE D28F6"
#string STR_TBT_HOST_LOCATION_007               #language eng "SB PCIE D28F7"
//#string STR_TBT_HOST_LOCATION_008               #language eng "SB PCIE D29F0"
//#string STR_TBT_HOST_LOCATION_009               #language eng "SB PCIE D29F1"
//#string STR_TBT_HOST_LOCATION_010               #language eng "SB PCIE D29F2"
//#string STR_TBT_HOST_LOCATION_011               #language eng "SB PCIE D29F3"
//#string STR_TBT_HOST_LOCATION_012               #language eng "SB PCIE D29F4"
//#string STR_TBT_HOST_LOCATION_013               #language eng "SB PCIE D29F5"
//#string STR_TBT_HOST_LOCATION_014               #language eng "SB PCIE D29F6"
//#string STR_TBT_HOST_LOCATION_015               #language eng "SB PCIE D29F7"
#string STR_TBT_HOST_LOCATION_016                #language eng "NB PCIE D01F0"
#string STR_TBT_HOST_LOCATION_017                #language eng "NB PCIE D01F1"
#string STR_TBT_HOST_LOCATION_018                #language eng "NB PCIE D01F2"


#string STR_TBT_HANDLE_POC_PROMPT               #language eng "Enable Handle TBT's POC"
#string STR_TBT_HANDLE_POC_HELP                 #language eng "Enable or disable to handle Thunderbolt host chip's POC."

#string STR_TBT_SMI_NOTIFY_SUPPORT_PROMPT       #language eng "SMI/Notify Support"
#string STR_TBT_SMI_NOTIFY_SUPPORT_HELP         #language eng "Enable or disable SMI/Notify support."

#string STR_TBT_SWSMI_SUPPORT_PROMPT            #language eng "SwSMI Support"
#string STR_TBT_SWSMI_SUPPORT_HELP              #language eng "Enable or disable SwSMI support in ASL code."

#string STR_TBT_NOTIFY_SUPPORT_PROMPT           #language eng "Notify Support"
#string STR_TBT_NOTIFY_SUPPORT_HELP             #language eng "Enable or disable Notify support in ASL code."

#string STR_TBT_OPTIONROM_SUPPORT_PROMPT        #language eng "Ignore Thunderbolt Option Rom"
#string STR_TBT_OPTIONROM_SUPPORT_HELP          #language eng "Enable or disable ignore Thunderbolt Device Option Rom. Enable will skip TBT Option Rom at POST time. Disable will excute TBT Option Rom at POST time."

#string STR_TBT_CACHE_LINE_SIZE_PROMPT          #language eng "Thunderbolt PCIe Cache-line Size"
#string STR_TBT_CACHE_LINE_SIZE_HELP            #language eng "Cache-line size value to be configured on Thunderbolt PCIe subtree."
#string STR_TBT_CACHE_LINE_SIZE_000             #language eng "0"
#string STR_TBT_CACHE_LINE_SIZE_001             #language eng "1"
#string STR_TBT_CACHE_LINE_SIZE_002             #language eng "2"
#string STR_TBT_CACHE_LINE_SIZE_004             #language eng "4"
#string STR_TBT_CACHE_LINE_SIZE_008             #language eng "8"
#string STR_TBT_CACHE_LINE_SIZE_016             #language eng "16"
#string STR_TBT_CACHE_LINE_SIZE_032             #language eng "32"
#string STR_TBT_CACHE_LINE_SIZE_064             #language eng "64"
#string STR_TBT_CACHE_LINE_SIZE_128             #language eng "128"

#string STR_TBT_SECURITY_LEVEL_PROMPT           #language eng "Security Level"
#string STR_TBT_SECURITY_LEVEL_HELP             #language eng "Security level selection."
#string STR_TBT_CR_MODE1                        #language eng "Normal Mode"
#string STR_TBT_CR_MODE2                        #language eng "Normal Mode w/o NHI" 
#string STR_TBT_CR_MODE3                        #language eng "Direct Connected w/o NHI"
#string STR_TBT_CR_MODE4                        #language eng "Redriver Only"
#string STR_TBT_CR_MODE5                        #language eng "Thunderbolt OFF"
#string STR_TBT_CR_MODE6                        #language eng "Debug Mode"

#string STR_TBT_RR_MODE1                        #language eng "Legacy Mode"
#string STR_TBT_RR_MODE2                        #language eng "Unique ID" 
#string STR_TBT_RR_MODE3                        #language eng "One time saved Key"
#string STR_TBT_RR_MODE4                        #language eng "DP++ only"

#string STR_TBT_WAKE_UP_DELAY_PROMPT            #language eng "Thunderbolt Wake Delay"
#string STR_TBT_WAKE_UP_DELAY_HELP              #language eng "This Delay is used to ensure completeness of TBT link to all endpoint devices."

#string STR_TBT_SWSMI_DELAY_PROMPT              #language eng "Thunderbolt SwSMI Delay"
#string STR_TBT_SWSMI_DELAY_HELP                #language eng "0 = Disable; 1 = 1ms; 1000 = 1sec ..."

#string STR_TBT_PERSLOT_RMEM_PROMPT             #language eng "Reseved Mem per phy slot"
#string STR_TBT_PERSLOT_RMEM_HELP               #language eng "If PCIe device consume < ~ MB of memory, BIOS will reserve ~ per physical slot."

#string STR_TBT_PERSLOT_PF_RMEM_PROMPT          #language eng "Reseved PMem per phy slot"
#string STR_TBT_PERSLOT_PF_RMEM_HELP            #language eng "If PCIe device consume < ~ MB of Prefatchable memory, BIOS will reserve ~ per physical slot."

#string STR_TBT_PERSLOT_RVIO_PROMPT             #language eng "Reseved IO per phy slot"
#string STR_TBT_PERSLOT_RVIO_HELP               #language eng "If PCIe device consume < ~ KB of Io space, BIOS will reserve ~ per physical slot."

#string STR_TBT_IORESOURCE_SUPPORT_PROMPT       #language eng "TBT Device IO resource Support"
#string STR_TBT_IORESOURCE_SUPPORT_HELP         #language eng "Enable or disable IO resource for Thunderbolt Device."

#string STR_TBT_RMV_RETURN_VALUE_PROMPT         #language eng "_RMV Method return value"
#string STR_TBT_RMV_RETURN_VALUE_HELP           #language eng "Choose _RMV Method return value for Thunderbolt in ASL code."
#string STR_TBT_RMV_RETURN_VALUE_0              #language eng "0"
#string STR_TBT_RMV_RETURN_VALUE_1              #language eng "1"

#string STR_TBT_NVM_VERSION_PROMPT              #language eng "TBT Host chip's NVM version"
#string STR_TBT_NVM_VERSION_HELP                #language eng "It is used for 4C 2port in IO resource workaround."

//---------------------------------------------------------------------------
// ACPI PCIE setting
//---------------------------------------------------------------------------
#string STR_ACPI_PCIE_NATIVE_PROMPT             #language eng "Native PCIE Enable"
#string STR_ACPI_PCIE_NATIVE_HELP               #language eng "PCI Express Native Support Enable/Disable. This feature is only available in Vista."

#string STR_ACPI_NATIVE_ASPM_PROMPT             #language eng "Native ASPM"
#string STR_ACPI_NATIVE_ASPM_HELP               #language eng "On enable, Vista will control the ASPM support for the device. If disabled, the BIOS will."

//---------------------------------------------------------------------------
// SB PCIE root port setting
//---------------------------------------------------------------------------
//#string STR_PCH_PCIERP1_PROMPT                  #language eng "PCI Express Root Port 1"
#string STR_PCH_PCIERP2_PROMPT                  #language eng "PCI Express Root Port 2"
#string STR_PCH_PCIERP3_PROMPT                  #language eng "PCI Express Root Port 3"
#string STR_PCH_PCIERP4_PROMPT                  #language eng "PCI Express Root Port 4"
//#string STR_PCH_PCIERP5_PROMPT                  #language eng "PCI Express Root Port 5"
#string STR_PCH_PCIERP6_PROMPT                  #language eng "PCI Express Root Port 6"
#string STR_PCH_PCIERP7_PROMPT                  #language eng "PCI Express Root Port 7"
#string STR_PCH_PCIERP8_PROMPT                  #language eng "PCI Express Root Port 8"
#string STR_PCH_PCIERP_HELP                     #language eng "Control the PCI Express Root Port."

#string STR_PCH_PCIE_PORT_SWAP_PROMPT           #language eng "PCI Express Root Port Function Swapping"
#string STR_PCH_PCIE_PORT_SWAP_HELP             #language eng "Enable or disable PCI Express PCI Express Root Port Function Swapping."

#string STR_PCH_PCIE_HPE_PROMPT                 #language eng "  Hot Plug"
#string STR_PCH_PCIE_HPE_HELP                   #language eng "Enable or disable PCI Express Hot Plug."

#string STR_PCH_PCIE_RBUS_PROMPT                #language eng "Extra Bus Reserved"
#string STR_PCH_PCIE_RBUS_HELP                  #language eng "Extra Bus Reserved (0-255) for bridges behind this Root Bridge."

#string STR_PCH_PCIE_RMEM_PROMPT                #language eng "Reseved Memory"
#string STR_PCH_PCIE_RMEM_HELP                  #language eng "Reserved Memory Range for this Root Bridge."

#string STR_PCH_PCIE_RMEM_ALIG_PROMPT           #language eng "Reseved Memory Alignment"
#string STR_PCH_PCIE_RMEM_ALIG_HELP             #language eng "Reseved Memory Alignment (0 - 31 bits)"

#string STR_PCH_PCIE_PF_RMEM_PROMPT             #language eng "Prefetchable Memory"
#string STR_PCH_PCIE_PF_RMEM_HELP               #language eng "Prefetchable Memory Range for this Root Bridge."

#string STR_PCH_PCIE_PF_RMEM_ALIG_PROMPT        #language eng "Prefetchable Memory Alignment"
#string STR_PCH_PCIE_PF_RMEM_ALIG_HELP          #language eng "Prefetchable Memory Alignment (0 - 31 bits)"

#string STR_PCH_PCIE_RVIO_PROMPT                #language eng "Reserved I/O"
#string STR_PCH_PCIE_RVIO_HELP                  #language eng "Reserved I/O (4K/8K/12K/16K/.../48K) Range for this Root Bridge."

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
